Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
gxflow-backend-sendJobEmail" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "pgxflow-backend-sendJobEmail" -> null
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:209479276142:function:pgxflow-backend-sendJobEmail/invocations" -> null
      - last_modified                  = "2025-09-16T08:40:55.355+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:pgxflow_backend_python_modules_layer:4",
        ] -> null
      - memory_size                    = 1792 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:209479276142:function:pgxflow-backend-sendJobEmail:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:209479276142:function:pgxflow-backend-sendJobEmail:$LATEST/invocations" -> null
      - region                         = "ap-southeast-3" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::209479276142:role/pgxflow-backend-sendJobEmail" -> null
      - runtime                        = "python3.12" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "9G2emaVXGCkSfUHoAr24dywXsXxkSsvCrL6bw2lJsXk=" -> null
      - source_code_size               = 1070 -> null
      - tags                           = {
          - "Environment"           = "STAGING"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "GXC"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - tags_all                       = {
          - "Environment"           = "STAGING"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "GXC"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - timeout                        = 28 -> null
      - version                        = "$LATEST" -> null
        # (5 unchanged attributes hidden)

      - environment {
          - variables = {
              - "COGNITO_CLINIC_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:209479276142:function:cognito-sendClinicJobEmail"
              - "DYNAMO_CLINIC_JOBS_TABLE"        = "sbeacon-dataportal-clinic-jobs"
              - "USER_POOL_ID"                    = "ap-southeast-3_BPVU2Ch1c"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/pgxflow-backend-sendJobEmail" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0] will be destroyed
  # (because module.pgxflow[0].module.lambda-sendJobEmail is not in configuration)
  - resource "null_resource" "archive" {
      - id       = "3611705641513829687" -> null
      - triggers = {
          - "filename"  = "builds/2d26d62301ee609c22b9ce864adea839b0695531c99b94868036112b261aeb3a.zip"
          - "timestamp" = "1754895045440283000"
        } -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_cloudwatch_event_rule.update_references_trigger will be destroyed
  # (because module.pgxflow[0].module.pipeline_lookup is not in configuration)
  - resource "aws_cloudwatch_event_rule" "update_references_trigger" {
      - arn                 = "arn:aws:events:ap-southeast-3:209479276142:rule/lookup_update_references_trigger" -> null
      - description         = "A scheduled trigger that checks for changes to and updates reference files used by PGxFlow's PharmCAT pipeline." -> null
      - event_bus_name      = "default" -> null
      - force_destroy       = false -> null
      - id                  = "lookup_update_references_trigger" -> null
      - is_enabled          = true -> null
      - name                = "lookup_update_references_trigger" -> null
      - region              = "ap-southeast-3" -> null
      - schedule_expression = "rate(1 day)" -> null
      - state               = "ENABLED" -> null
      - tags                = {} -> null
      - tags_all            = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_cloudwatch_event_target.update_references_trigger will be destroyed
  # (because module.pgxflow[0].module.pipeline_lookup is not in configuration)
  - resource "aws_cloudwatch_event_target" "update_references_trigger" {
      - arn            = "arn:aws:lambda:ap-southeast-3:209479276142:function:pgxflow-backend-lookup-updateReferenceFiles" -> null
      - event_bus_name = "default" -> null
      - force_destroy  = false -> null
      - id             = "lookup_update_references_trigger-lambda-lookup-updateReferenceFiles" -> null
      - region         = "ap-southeast-3" -> null
      - rule           = "lookup_update_references_trigger" -> null
      - target_id      = "lambda-lookup-updateReferenceFiles" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_lambda_permission.cloudwatch_lookup_reference_update_permission will be destroyed
  # (because module.pgxflow[0].module.pipeline_lookup is not in configuration)
  - resource "aws_lambda_permission" "cloudwatch_lookup_reference_update_permission" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "pgxflow-backend-lookup-updateReferenceFiles" -> null
      - id                  = "CloudwatchLookupReferenceUpdateAllowInvoke" -> null
      - principal           = "events.amazonaws.com" -> null
      - region              = "ap-southeast-3" -> null
      - source_arn          = "arn:aws:events:ap-southeast-3:209479276142:rule/lookup_update_references_trigger" -> null
      - statement_id        = "CloudwatchLookupReferenceUpdateAllowInvoke" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_lambda_permission.dbsnp_invoke_permission will be destroyed
  # (because module.pgxflow[0].module.pipeline_lookup is not in configuration)
  - resource "aws_lambda_permission" "dbsnp_invoke_permission" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "pgxflow-backend-dbsnp" -> null
      - id                  = "SNSDbsnpAllowInvoke" -> null
      - principal           = "sns.amazonaws.com" -> null
      - region              = "ap-southeast-3" -> null
      - source_arn          = "arn:aws:sns:ap-southeast-3:209479276142:pgxflow-backend-dbsnp" -> null
      - statement_id        = "SNSDbsnpAllowInvoke" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_sns_topic.dbsnp will be destroyed
  # (because module.pgxflow[0].module.pipeline_lookup is not in configuration)
  - resource "aws_sns_topic" "dbsnp" {
      - application_success_feedback_sample_rate = 0 -> null
      - arn                                      = "arn:aws:sns:ap-southeast-3:209479276142:pgxflow-backend-dbsnp" -> null
      - content_based_deduplication              = false -> null
      - fifo_topic                               = false -> null
      - firehose_success_feedback_sample_rate    = 0 -> null
      - http_success_feedback_sample_rate        = 0 -> null
      - id                                       = "arn:aws:sns:ap-southeast-3:209479276142:pgxflow-backend-dbsnp" -> null
      - lambda_success_feedback_sample_rate      = 0 -> null
      - name                                     = "pgxflow-backend-dbsnp" -> null
      - owner                                    = "209479276142" -> null
      - policy                                   = jsonencode(
            {
              - Id        = "__default_policy_ID"
              - Statement = [
                  - {
                      - Action    = [
                          - "SNS:GetTopicAttributes",
                          - "SNS:SetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:RemovePermission",
                          - "SNS:DeleteTopic",
                          - "SNS:Subscribe",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:Publish",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceOwner" = "209479276142"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:ap-southeast-3:209479276142:pgxflow-backend-dbsnp"
                      - Sid       = "__default_statement_ID"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - region                                   = "ap-southeast-3" -> null
      - signature_version                        = 0 -> null
      - sqs_success_feedback_sample_rate         = 0 -> null
      - tags                                     = {} -> null
      - tags_all                                 = {} -> null
        # (18 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_sns_topic_subscription.dbsnp will be destroyed
  # (because module.pgxflow[0].module.pipeline_lookup is not in configuration)
  - resource "aws_sns_topic_subscription" "dbsnp" {
      - arn                             = "arn:aws:sns:ap-southeast-3:209479276142:pgxflow-backend-dbsnp:9c64e42e-d095-43c2-8647-4a4d607d6b4e" -> null
      - confirmation_timeout_in_minutes = 1 -> null
      - confirmation_was_authenticated  = true -> null
      - endpoint                        = "arn:aws:lambda:ap-southeast-3:209479276142:function:pgxflow-backend-dbsnp" -> null
      - endpoint_auto_confirms          = false -> null
      - id                              = "arn:aws:sns:ap-southeast-3:209479276142:pgxflow-backend-dbsnp:9c64e42e-d095-43c2-8647-4a4d607d6b4e" -> null
      - owner_id                        = "209479276142" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "lambda" -> null
      - raw_message_delivery            = false -> null
      - region                          = "ap-southeast-3" -> null
      - topic_arn                       = "arn:aws:sns:ap-southeast-3:209479276142:pgxflow-backend-dbsnp" -> null
        # (6 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_cloudwatch_event_rule.update_references_trigger will be destroyed
  # (because module.pgxflow[0].module.pipeline_pharmcat is not in configuration)
  - resource "aws_cloudwatch_event_rule" "update_references_trigger" {
      - arn                 = "arn:aws:events:ap-southeast-3:209479276142:rule/pharmcat_update_references_trigger" -> null
      - description         = "A scheduled trigger that checks for changes to and updates reference files used by PGxFlow's PharmCAT pipeline." -> null
      - event_bus_name      = "default" -> null
      - force_destroy       = false -> null
      - id                  = "pharmcat_update_references_trigger" -> null
      - is_enabled          = true -> null
      - name                = "pharmcat_update_references_trigger" -> null
      - region              = "ap-southeast-3" -> null
      - schedule_expression = "rate(1 day)" -> null
      - state               = "ENABLED" -> null
      - tags                = {} -> null
      - tags_all            = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_cloudwatch_event_target.update_references_trigger will be destroyed
  # (because module.pgxflow[0].module.pipeline_pharmcat is not in configuration)
  - resource "aws_cloudwatch_event_target" "update_references_trigger" {
      - arn            = "arn:aws:lambda:ap-southeast-3:209479276142:function:pgxflow-backend-pharmcat-updateReferenceFiles" -> null
      - event_bus_name = "default" -> null
      - force_destroy  = false -> null
      - id             = "pharmcat_update_references_trigger-lambda-pharmcat-updateReferenceFiles" -> null
      - region         = "ap-southeast-3" -> null
      - rule           = "pharmcat_update_references_trigger" -> null
      - target_id      = "lambda-pharmcat-updateReferenceFiles" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.LambdaPharmcat will be destroyed
  # (because module.pgxflow[0].module.pipeline_pharmcat is not in configuration)
  - resource "aws_lambda_permission" "LambdaPharmcat" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "arn:aws:lambda:ap-southeast-3:209479276142:function:pgxflow-backend-pharmcat" -> null
      - id                  = "PGxFlowBackendAllowLambdaPharmcatInvoke" -> null
      - principal           = "lambda.amazonaws.com" -> null
      - region              = "ap-southeast-3" -> null
      - source_arn          = "arn:aws:lambda:ap-southeast-3:209479276142:function:pgxflow-backend-preprocessor" -> null
      - statement_id        = "PGxFlowBackendAllowLambdaPharmcatInvoke" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.LambdaPostprocessor will be destroyed
  # (because module.pgxflow[0].module.pipeline_pharmcat is not in configuration)
  - resource "aws_lambda_permission" "LambdaPostprocessor" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "arn:aws:lambda:ap-southeast-3:209479276142:function:pgxflow-backend-postprocessor" -> null
      - id                  = "PGxFlowBackendAllowLambdaPostprocessorInvoke" -> null
      - principal           = "lambda.amazonaws.com" -> null
      - region              = "ap-southeast-3" -> null
      - source_arn          = "arn:aws:lambda:ap-southeast-3:209479276142:function:pgxflow-backend-pharmcat" -> null
      - statement_id        = "PGxFlowBackendAllowLambdaPostprocessorInvoke" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.cloudwatch_pharmcat_reference_update_permission will be destroyed
  # (because module.pgxflow[0].module.pipeline_pharmcat is not in configuration)
  - resource "aws_lambda_permission" "cloudwatch_pharmcat_reference_update_permission" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "pgxflow-backend-pharmcat-updateReferenceFiles" -> null
      - id                  = "CloudwatchPharmcatReferenceUpdateAllowInvoke" -> null
      - principal           = "events.amazonaws.com" -> null
      - region              = "ap-southeast-3" -> null
      - source_arn          = "arn:aws:events:ap-southeast-3:209479276142:rule/pharmcat_update_references_trigger" -> null
      - statement_id        = "CloudwatchPharmcatReferenceUpdateAllowInvoke" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.preprocessor_invoke_permission will be destroyed
  # (because module.pgxflow[0].module.pipeline_pharmcat is not in configuration)
  - resource "aws_lambda_permission" "preprocessor_invoke_permission" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "pgxflow-backend-preprocessor" -> null
      - id                  = "SNSPreprocessorAllowInvoke" -> null
      - principal           = "sns.amazonaws.com" -> null
      - region              = "ap-southeast-3" -> null
      - source_arn          = "arn:aws:sns:ap-southeast-3:209479276142:pgxflow-backend-preprocessor" -> null
      - statement_id        = "SNSPreprocessorAllowInvoke" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_sns_topic.preprocessor will be destroyed
  # (because module.pgxflow[0].module.pipeline_pharmcat is not in configuration)
  - resource "aws_sns_topic" "preprocessor" {
      - application_success_feedback_sample_rate = 0 -> null
      - arn                                      = "arn:aws:sns:ap-southeast-3:209479276142:pgxflow-backend-preprocessor" -> null
      - content_based_deduplication              = false -> null
      - fifo_topic                               = false -> null
      - firehose_success_feedback_sample_rate    = 0 -> null
      - http_success_feedback_sample_rate        = 0 -> null
      - id                                       = "arn:aws:sns:ap-southeast-3:209479276142:pgxflow-backend-preprocessor" -> null
      - lambda_success_feedback_sample_rate      = 0 -> null
      - name                                     = "pgxflow-backend-preprocessor" -> null
      - owner                                    = "209479276142" -> null
      - policy                                   = jsonencode(
            {
              - Id        = "__default_policy_ID"
              - Statement = [
                  - {
                      - Action    = [
                          - "SNS:GetTopicAttributes",
                          - "SNS:SetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:RemovePermission",
                          - "SNS:DeleteTopic",
                          - "SNS:Subscribe",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:Publish",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceOwner" = "209479276142"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:ap-southeast-3:209479276142:pgxflow-backend-preprocessor"
                      - Sid       = "__default_statement_ID"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - region                                   = "ap-southeast-3" -> null
      - signature_version                        = 0 -> null
      - sqs_success_feedback_sample_rate         = 0 -> null
      - tags                                     = {} -> null
      - tags_all                                 = {} -> null
        # (18 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_sns_topic_subscription.preprocessor will be destroyed
  # (because module.pgxflow[0].module.pipeline_pharmcat is not in configuration)
  - resource "aws_sns_topic_subscription" "preprocessor" {
      - arn                             = "arn:aws:sns:ap-southeast-3:209479276142:pgxflow-backend-preprocessor:2d2b35b5-faba-42d9-8745-c4076fbe2637" -> null
      - confirmation_timeout_in_minutes = 1 -> null
      - confirmation_was_authenticated  = true -> null
      - endpoint                        = "arn:aws:lambda:ap-southeast-3:209479276142:function:pgxflow-backend-preprocessor" -> null
      - endpoint_auto_confirms          = false -> null
      - id                              = "arn:aws:sns:ap-southeast-3:209479276142:pgxflow-backend-preprocessor:2d2b35b5-faba-42d9-8745-c4076fbe2637" -> null
      - owner_id                        = "209479276142" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "lambda" -> null
      - raw_message_delivery            = false -> null
      - region                          = "ap-southeast-3" -> null
      - topic_arn                       = "arn:aws:sns:ap-southeast-3:209479276142:pgxflow-backend-preprocessor" -> null
        # (6 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_libraries_layer.aws_lambda_layer_version.this[0] will be destroyed
  # (because module.pgxflow[0].module.python_libraries_layer is not in configuration)
  - resource "aws_lambda_layer_version" "this" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:209479276142:layer:pgxflow_backend_python_libraries_layer:3" -> null
      - code_sha256                 = "iWHbWqHlAUkaTEMg56nhLJEDE1jLvpE2lp/XF/nTXHQ=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-09-16T08:44:08.785+0000" -> null
      - description                 = "python libraries" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:209479276142:layer:pgxflow_backend_python_libraries_layer:3" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:209479276142:layer:pgxflow_backend_python_libraries_layer" -> null
      - layer_name                  = "pgxflow_backend_python_libraries_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - s3_bucket                   = "pgxflow-backend-layers-20250916084019206100000003" -> null
      - s3_key                      = "builds/05f3b78e55249542caeefcab8738ca41a636d9caa3f44d32053b9c1705b80174.zip" -> null
      - skip_destroy                = false -> null
      - source_code_size            = 172611 -> null
      - version                     = "3" -> null
        # (5 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_libraries_layer.aws_s3_object.lambda_package[0] will be destroyed
  # (because module.pgxflow[0].module.python_libraries_layer is not in configuration)
  - resource "aws_s3_object" "lambda_package" {
      - acl                           = "private" -> null
      - arn                           = "arn:aws:s3:::pgxflow-backend-layers-20250916084019206100000003/builds/05f3b78e55249542caeefcab8738ca41a636d9caa3f44d32053b9c1705b80174.zip" -> null
      - bucket                        = "pgxflow-backend-layers-20250916084019206100000003" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "application/octet-stream" -> null
      - etag                          = "5dfcc4cbe816de683ac7ed15eecb1004" -> null
      - force_destroy                 = false -> null
      - id                            = "pgxflow-backend-layers-20250916084019206100000003/builds/05f3b78e55249542caeefcab8738ca41a636d9caa3f44d32053b9c1705b80174.zip" -> null
      - key                           = "builds/05f3b78e55249542caeefcab8738ca41a636d9caa3f44d32053b9c1705b80174.zip" -> null
      - metadata                      = {} -> null
      - region                        = "ap-southeast-3" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "builds/05f3b78e55249542caeefcab8738ca41a636d9caa3f44d32053b9c1705b80174.zip" -> null
      - storage_class                 = "ONEZONE_IA" -> null
      - tags                          = {} -> null
      - tags_all                      = {} -> null
        # (14 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_libraries_layer.null_resource.archive[0] will be destroyed
  # (because module.pgxflow[0].module.python_libraries_layer is not in configuration)
  - resource "null_resource" "archive" {
      - id       = "8102152900779352690" -> null
      - triggers = {
          - "filename"  = "builds/05f3b78e55249542caeefcab8738ca41a636d9caa3f44d32053b9c1705b80174.zip"
          - "timestamp" = "1753257510867838000"
        } -> null
    }

  # module.pgxflow[0].module.python_modules_layer.aws_lambda_layer_version.this[0] will be destroyed
  # (because module.pgxflow[0].module.python_modules_layer is not in configuration)
  - resource "aws_lambda_layer_version" "this" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:209479276142:layer:pgxflow_backend_python_modules_layer:4" -> null
      - code_sha256                 = "UHPcmwwXQZYTD+Z4zxZThfAvHtC3Jb/15L3xCR/JCSs=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-09-16T08:40:31.787+0000" -> null
      - description                 = "python modules" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:209479276142:layer:pgxflow_backend_python_modules_layer:4" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:209479276142:layer:pgxflow_backend_python_modules_layer" -> null
      - layer_name                  = "pgxflow_backend_python_modules_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - s3_bucket                   = "pgxflow-backend-layers-20250916084019206100000003" -> null
      - s3_key                      = "builds/1c570b62fab4753fc9a70120ecfb7e800f2e47b4b0b3a8161eba4b43ea6ba167.zip" -> null
      - skip_destroy                = false -> null
      - source_code_size            = 7658 -> null
      - version                     = "4" -> null
        # (5 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_modules_layer.aws_s3_object.lambda_package[0] will be destroyed
  # (because module.pgxflow[0].module.python_modules_layer is not in configuration)
  - resource "aws_s3_object" "lambda_package" {
      - acl                           = "private" -> null
      - arn                           = "arn:aws:s3:::pgxflow-backend-layers-20250916084019206100000003/builds/1c570b62fab4753fc9a70120ecfb7e800f2e47b4b0b3a8161eba4b43ea6ba167.zip" -> null
      - bucket                        = "pgxflow-backend-layers-20250916084019206100000003" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "application/octet-stream" -> null
      - etag                          = "fb6f5b4c19fa3e429575796e4a761b6b" -> null
      - force_destroy                 = false -> null
      - id                            = "pgxflow-backend-layers-20250916084019206100000003/builds/1c570b62fab4753fc9a70120ecfb7e800f2e47b4b0b3a8161eba4b43ea6ba167.zip" -> null
      - key                           = "builds/1c570b62fab4753fc9a70120ecfb7e800f2e47b4b0b3a8161eba4b43ea6ba167.zip" -> null
      - metadata                      = {} -> null
      - region                        = "ap-southeast-3" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "builds/1c570b62fab4753fc9a70120ecfb7e800f2e47b4b0b3a8161eba4b43ea6ba167.zip" -> null
      - storage_class                 = "ONEZONE_IA" -> null
      - tags                          = {} -> null
      - tags_all                      = {} -> null
        # (14 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_modules_layer.null_resource.archive[0] will be destroyed
  # (because module.pgxflow[0].module.python_modules_layer is not in configuration)
  - resource "null_resource" "archive" {
      - id       = "1188596231996432929" -> null
      - triggers = {
          - "filename"  = "builds/1c570b62fab4753fc9a70120ecfb7e800f2e47b4b0b3a8161eba4b43ea6ba167.zip"
          - "timestamp" = "1754895045310096000"
        } -> null
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:2a20bfdf0d8a0e81cd0686f89fadf4259ffdd0beefd6d77a90db2e5987e569ac209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:2a20bfdf0d8a0e81cd0686f89fadf4259ffdd0beefd6d77a90db2e5987e569ac" -> (known after apply)
        name         = "209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ repo_digest  = "209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:e7047aeb674ceb149d6f5acfd48d3f2f9d6d8f5e828510e741c67a7a94a7a6bd" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "03fc8941492c98e8b2e2a0a89c4497796f5748fc" -> "f15a555c49cdf821767525b63072e970e82d28ef"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "sbeacon/lambda/submitDataset" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "sbeacon/lambda/submitDataset"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:e7047aeb674ceb149d6f5acfd48d3f2f9d6d8f5e828510e741c67a7a94a7a6bd" -> (known after apply)
        name                 = "209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ sha256_digest        = "sha256:e7047aeb674ceb149d6f5acfd48d3f2f9d6d8f5e828510e741c67a7a94a7a6bd" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "03fc8941492c98e8b2e2a0a89c4497796f5748fc" -> "f15a555c49cdf821767525b63072e970e82d28ef"
        }
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/9ed7a3a53893853906a8cb3982a3442b5dae98a49d53a0c7a6e48775a617e148.zip" -> "builds/f3dfb069830f98ade3fd060f88b00ac517ce4fb34984818356232a3363eecdaf.zip"
        id                             = "sbeacon-backend-admin"
      ~ last_modified                  = "2025-09-18T04:54:02.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:49",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:70",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/admin",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/f3dfb069830f98ade3fd060f88b00ac517ce4fb34984818356232a3363eecdaf.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/f3dfb069830f98ade3fd060f88b00ac517ce4fb34984818356232a3363eecdaf.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "832599529125360638" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/9ed7a3a53893853906a8cb3982a3442b5dae98a49d53a0c7a6e48775a617e148.zip" -> "builds/f3dfb069830f98ade3fd060f88b00ac517ce4fb34984818356232a3363eecdaf.zip"
          ~ "timestamp" = "1758168839877384000" -> "1758509773920903000"
        }
    }

  # module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-0"
        name        = "sbeacon-backend-dataPortal-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-users-quota",
                          - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-users-info",
                          - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-saved-queries",
                          - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-projects",
                          - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-project-users",
                          - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-pricing-cache",
                          - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-juptyer-notebooks",
                          - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinical-variants",
                          - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinical-annotations",
                          - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs",
                          - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-cli-upload",
                        ]
                    },
                  - {
                      - Action   = "pricing:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-project-users/index/uid-index",
                          - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
                          - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-cli-upload/index/cli-uploads-project-name-index",
                        ]
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:209479276142:userpool/ap-southeast-3_BPVU2Ch1c"
                    },
                  - {
                      - Action   = [
                          - "sagemaker:UpdateNotebookInstance",
                          - "sagemaker:StopNotebookInstance",
                          - "sagemaker:StartNotebookInstance",
                          - "sagemaker:ListNotebookInstances",
                          - "sagemaker:DescribeNotebookInstance",
                          - "sagemaker:DeleteNotebookInstance",
                          - "sagemaker:CreatePresignedNotebookInstanceUrl",
                          - "sagemaker:CreateNotebookInstance",
                          - "sagemaker:AddTags",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sagemaker:ap-southeast-3:209479276142:notebook-instance/*"
                    },
                  - {
                      - Action   = "sagemaker:ListNotebookInstances"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:iam::209479276142:role/sbeacon_backend_sagemaker_jupyter_instance_role"
                    },
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = [
                                  - "projects/*",
                                  - "private/*",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::gaspi-dataportal-20250725085318492000000003"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata-20250725085316769800000002/*",
                          - "arn:aws:s3:::gaspi-dataportal-20250725085318492000000003/*",
                        ]
                    },
                  - {
                      - Action   = "s3:DeleteObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250725085318492000000003/private/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250916084019181300000002"
                    },
                  - {
                      - Action   = "s3:DeleteObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250916084019181300000002/*"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ap-southeast-3:209479276142:function:sbeacon-backend-submitDataset",
                          - "arn:aws:lambda:ap-southeast-3:209479276142:function:sbeacon-backend-indexer",
                          - "arn:aws:lambda:ap-southeast-3:209479276142:function:sbeacon-backend-generateReports",
                          - "arn:aws:lambda:ap-southeast-3:209479276142:function:sbeacon-backend-generateCohortVCfs",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/a122d8c3b94b28867e80b1b41993e9f8360862b6c3d093aef7f2d3a6b55cdf50.zip" -> "builds/df505a651c30374cbad1f9477c9b2e73ad45d244ed842aa307821d174a50d014.zip"
        id                             = "sbeacon-backend-dataPortal"
      ~ last_modified                  = "2025-09-22T01:56:52.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:49",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:70",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "ATHENA_METADATA_BUCKET"               = "gaspi-metadata-20250725085316769800000002"
              - "BEACON_ALTERNATIVE_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_API_VERSION"                   = "v2.0.0"
              - "BEACON_CREATE_DATETIME"               = "2018-11-26H00:00:00Z"
              - "BEACON_DEFAULT_GRANULARITY"           = "boolean"
              - "BEACON_DESCRIPTION"                   = "Serverless Beacon (sBeacon)"
              - "BEACON_DOCUMENTATION_URL"             = "https://github.com/EGA-archive/beacon2-ri-api"
              - "BEACON_ENVIRONMENT"                   = "dev"
              - "BEACON_HANDOVERS"                     = jsonencode([])
              - "BEACON_ID"                            = "au.csiro.sbeacon"
              - "BEACON_NAME"                          = "CSIRO Serverless Beacon"
              - "BEACON_ORG_ADDRESS"                   = "AEHRC, Westmead NSW, Australia"
              - "BEACON_ORG_CONTACT_URL"               = "https://bioinformatics.csiro.au/get-in-touch/"
              - "BEACON_ORG_DESCRIPTION"               = "CSIRO, Australia"
              - "BEACON_ORG_ID"                        = "CSIRO"
              - "BEACON_ORG_LOGO_URL"                  = "https://raw.githubusercontent.com/aehrc/terraform-aws-serverless-beacon/master/assets/logo-tile.png"
              - "BEACON_ORG_NAME"                      = "CSIRO"
              - "BEACON_ORG_WELCOME_URL"               = "https://bioinformatics.csiro.au/"
              - "BEACON_SERVICE_TYPE_ARTIFACT"         = "beacon"
              - "BEACON_SERVICE_TYPE_GROUP"            = "au.csiro"
              - "BEACON_SERVICE_TYPE_VERSION"          = "1.0"
              - "BEACON_UPDATE_DATETIME"               = "2023-03-16H00:00:00Z"
              - "BEACON_URI"                           = "https://beacon.csiro.au"
              - "BEACON_VERSION"                       = "v0.1.0"
              - "BEACON_WELCOME_URL"                   = "https://bioinformatics.csiro.au/"
              - "CLINIC_TEMP_BUCKET_NAMES"             = "pgxflow-backend-20250916084019181300000002"
              - "COGNITO_ADMIN_GROUP_NAME"             = "administrators"
              - "COGNITO_MANAGER_GROUP_NAME"           = "managers"
              - "COHORT_MAKER_LAMBDA"                  = "sbeacon-backend-generateCohortVCfs"
              - "CONFIG_MAX_VARIANT_SEARCH_BASE_RANGE" = "5000"
              - "DPORTAL_BUCKET"                       = "gaspi-dataportal-20250725085318492000000003"
              - "DYNAMO_ANSCESTORS_TABLE"              = "sbeacon-Anscestors"
              - "DYNAMO_CLINICAL_ANNOTATIONS_TABLE"    = "sbeacon-dataportal-clinical-annotations"
              - "DYNAMO_CLINICAL_VARIANTS_TABLE"       = "sbeacon-dataportal-clinical-variants"
              - "DYNAMO_CLINIC_JOBS_TABLE"             = "sbeacon-dataportal-clinic-jobs"
              - "DYNAMO_CLI_UPLOAD_TABLE"              = "sbeacon-dataportal-cli-upload"
              - "DYNAMO_DATAPORTAL_LOCKS_TABLE"        = "sbeacon-dataportal-mutex-locks"
              - "DYNAMO_DESCENDANTS_TABLE"             = "sbeacon-Descendants"
              - "DYNAMO_JUPYTER_INSTANCES_TABLE"       = "sbeacon-dataportal-juptyer-notebooks"
              - "DYNAMO_ONTOLOGIES_TABLE"              = "sbeacon-Ontologies"
              - "DYNAMO_PRICING_CACHE_TABLE"           = "sbeacon-dataportal-pricing-cache"
              - "DYNAMO_PROJECTS_TABLE"                = "sbeacon-dataportal-projects"
              - "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              - "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
              - "DYNAMO_QUOTA_USER_TABLE"              = "sbeacon-dataportal-users-quota"
              - "DYNAMO_SAVED_QUERIES_TABLE"           = "sbeacon-dataportal-saved-queries"
              - "DYNAMO_USER_INFO_TABLE"               = "sbeacon-dataportal-users-info"
              - "HUB_NAME"                             = "RSPON"
              - "INDEXER_LAMBDA"                       = "sbeacon-backend-indexer"
              - "JUPYTER_INSTACE_ROLE_ARN"             = "arn:aws:iam::209479276142:role/sbeacon_backend_sagemaker_jupyter_instance_role"
              - "JUPYTER_LIFECYCLE_CONFIG_NAME"        = "clone-gaspi-notebooks"
              - "REPORTS_LAMBDA"                       = "sbeacon-backend-generateReports"
              - "SUBMIT_LAMBDA"                        = "sbeacon-backend-submitDataset"
              - "USER_POOL_ID"                         = "ap-southeast-3_BPVU2Ch1c"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/dataPortal/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/dataPortal",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/df505a651c30374cbad1f9477c9b2e73ad45d244ed842aa307821d174a50d014.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/df505a651c30374cbad1f9477c9b2e73ad45d244ed842aa307821d174a50d014.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2308738910454069008" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/a122d8c3b94b28867e80b1b41993e9f8360862b6c3d093aef7f2d3a6b55cdf50.zip" -> "builds/df505a651c30374cbad1f9477c9b2e73ad45d244ed842aa307821d174a50d014.zip"
          ~ "timestamp" = "1758181522830336000" -> "1758509773095951000"
        }
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-deidentifyFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:49",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:70",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_binaries_layer:41",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2131392976446049109" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1754973981141490000" -> "1758509773203847000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateCohortVCfs"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:49",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:70",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_binaries_layer:41",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7205211433135447926" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1745917272841880000" -> "1758509774960501000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateReports.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/fabb1b52b7403039178e3eb53c63d04c7a71303db960bed93cf92984e271333e.zip" -> "builds/7d7b2577a7bfe84d51ee62615c57a1602217fb145be86cb921815a44983cd32d.zip"
        id                             = "sbeacon-backend-generateReports"
      ~ last_modified                  = "2025-09-22T01:56:46.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateReports.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/generateReports/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/generateReports",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/7d7b2577a7bfe84d51ee62615c57a1602217fb145be86cb921815a44983cd32d.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/7d7b2577a7bfe84d51ee62615c57a1602217fb145be86cb921815a44983cd32d.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7759752645482798823" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/fabb1b52b7403039178e3eb53c63d04c7a71303db960bed93cf92984e271333e.zip" -> "builds/7d7b2577a7bfe84d51ee62615c57a1602217fb145be86cb921815a44983cd32d.zip"
          ~ "timestamp" = "1758506052529601000" -> "1758509773804088200"
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getAnalyses"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:49",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:70",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2948785017503440525" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751516672265724000" -> "1758509773944668000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getBiosamples"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:49",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:70",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7259369106371896289" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751516672213718800" -> "1758509773671353200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getConfiguration"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:49",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:70",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4597552558476942288" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208216634527000" -> "1758509773918988000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/74827b7c33367c85a24bbc7acb24a868b79c62e1bfdcca1014bc6aac52aa0f44.zip" -> "builds/7aec8f356e453d6aee2d1d5c081c06c37bfddae4305dfb0189500f54cec0b601.zip"
        id                             = "sbeacon-backend-getDatasets"
      ~ last_modified                  = "2025-09-15T04:21:10.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:49",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:70",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getDatasets",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/7aec8f356e453d6aee2d1d5c081c06c37bfddae4305dfb0189500f54cec0b601.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/7aec8f356e453d6aee2d1d5c081c06c37bfddae4305dfb0189500f54cec0b601.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4883924865443757670" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/74827b7c33367c85a24bbc7acb24a868b79c62e1bfdcca1014bc6aac52aa0f44.zip" -> "builds/7aec8f356e453d6aee2d1d5c081c06c37bfddae4305dfb0189500f54cec0b601.zip"
          ~ "timestamp" = "1751516671899504000" -> "1758509773200232000"
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getEntryTypes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:49",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:70",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8226260709120362082" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733208216193988000" -> "1758509774929072000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getFilteringTerms"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:49",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:70",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "611588379733231446" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733722167994541800" -> "1758509773966157000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:49",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_modules_layer:70",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4086064961699132300" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751516672138715000" -> "1758509773223200000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getIndividuals"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:l
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.